### Question 1 - Download the customer data set and add it to your “Original Data” folder.

### Question 2 - Create a new notebook in your “Scripts” folder for part 1 of this task.

### Question 3 - Import your analysis libraries, as well as your new customer data set as a dataframe.

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Create a path variable

path = r'/Users/davidcarpenter/Documents/Instacart Basket Analysis'

In [3]:
# Import the dataframe

df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [4]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### Question 4 - Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [5]:
df_customers.rename(columns={'First Name': 'first_name'}, inplace=True)

In [6]:
df_customers.head()

,user_id,first_name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
# Rename some of the columns to start.

df_customers.rename(columns={'surname': 'last_name', 'Gender': 'gender', 'STATE': 'state', 'Age': 'age',}, inplace=True)

In [8]:
# Examine the column names to ensure that the renaming was successful.

df_customers.head()

,user_id,first_name,Surnam,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
# Rename the remaining columns.

df_customers.rename(columns={'n_dependants': 'dependants', 'fam_status': 'marital_status'}, inplace = True)

In [10]:
# Check all columns to ensure that the renaming was successful.

df_customers.head()

,user_id,first_name,Surnam,gender,state,age,date_joined,dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### Question 5 - Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [11]:
# Check for mixed data types; from Exercise 4.5, section 'Mixed-Type Data'

for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

first_name

#### The column 'first_name' contains different data types

#### Convert the values in the 'first_name' column to 'string'

In [12]:
df_customers['first_name'] = df_customers['first_name'].astype('str')

In [13]:
# Check to confirm that the data type conversion was successful.

for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

#### The conversion was successful.

In [14]:
# Find missing values; from Exercise 4.5, section 'Missing Values'

df_customers.isnull().sum()

user_id           0
first_name        0
Surnam            0
gender            0
state             0
age               0
date_joined       0
dependants        0
marital_status    0
income            0
dtype: int64

#### There are not any missing values in any of the columns.

In [15]:
# Find only rows that contain duplicates; from Exercise 4.5, section 'Duplicates'

df_dups = df_customers[df_customers.duplicated()]

In [16]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, Surnam, gender, state, age, date_joined, dependants, marital_status, income]
Index: []

#### There are not any rows that contain duplicates.

### Question 6 - Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

#### Examine the data types for the rows in the 'df_customers' dataframe.

In [17]:
df_customers.head()

,user_id,first_name,Surnam,gender,state,age,date_joined,dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [18]:
# Import the dataframe

ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ex4-8-orders_products_merged.pkl'))

In [19]:
# View data types for the 'ords_prods_merge' dataframe; I will combine the 'ords_prods_merge' and 'df_customers'
# dataframes on the 'user_id' column and I want to ensure that the 'user_id' column has the same data type in
# each dataframe.

ords_prods_merge.dtypes
#ords_prods_merge.tail(50)

Unnamed: 0_x                 int64
product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
Unnamed: 0_y                 int64
order_id                     int64
user_id                      int64
eval_set                    object
order_number                 int64
order_dow                    int64
order_hour_of_day            int64
days_since_prior_order     float64
add_to_cart_order            int64
reordered                    int64
_merge                    category
price_range_loc             object
busiest_days                object
slowest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
avg_price                  float64
spend_type                  object
order_frequency            float64
order_type                  object
dtype: object

In [20]:
# View data types for the 'df_customers' dataframe.

df_customers.dtypes

user_id            int64
first_name        object
Surnam            object
gender            object
state             object
age                int64
date_joined       object
dependants         int64
marital_status    object
income             int64
dtype: object

#### The column 'user_id' in both the 'ords_prods_merge' and 'df_customers' dataframes is the same--it's of type int64.

In [21]:
# Combine the two dataframes into a new dataframe called 'combined_df' and use the 'user_id' column to join.

combined_df = ords_prods_merge.merge(df_customers, on = 'user_id')

In [22]:
# View shape of 'ords_prods_merge' dataframe.

ords_prods_merge.shape

(32434212, 27)

In [23]:
# View shape of 'df_customers' dataframe.

df_customers.shape

(206209, 10)

In [24]:
# View shape of 'combined_df' dataframe.

combined_df.shape

(32434212, 36)

In [25]:
# View head of newly created dataframe.

combined_df.head()

,Unnamed: 0_x,product_id,product_name,aisle_id,department_id,prices,Unnamed: 0_y,order_id,user_id,eval_set,...,order_type,first_name,Surnam,gender,state,age,date_joined,dependants,marital_status,income
0,0,1,Chocolate Sandwich Cookies,61,19,5.8,1987,3139998,138,prior,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
1,0,1,Chocolate Sandwich Cookies,61,19,5.8,1989,1977647,138,prior,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
2,907,907,Premium Sliced Bacon,106,12,20.0,1960,3160996,138,prior,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
3,907,907,Premium Sliced Bacon,106,12,20.0,1969,2254091,138,prior,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
4,1000,1000,Apricots,18,10,12.9,1968,505689,138,prior,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620

### Question 7 - Ensure your notebook contains logical titles, section headings, and descriptive code comments.

### Question 8 - Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [26]:
# Export the notebook to Pickle format, file is about 7.7GB in size.

combined_df.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ex4-9-exercise-part-1.pkl'))